test/upward_seepage_new/mix_wet_coeff_2/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0;
  }

  pFinal
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0;
  }

  U
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
  }

  k
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
  }

  epsilon
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
  }

  R
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
  }

  nuTilda
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
  }

  phiIB
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-06;
    relTol          0;
  }
}

PISO
{
  nCorrectors     4;
  nNonOrthogonalCorrectors 1;
  pRefCell        0;
  pRefValue       0;
}
